Update firebase
